null/xdslog/sentMessages/2015/4/20/sent_ProvideAndRegisterDocumentSet-b_null#9553ce76-ff03-4da6-ad82-b417224186bb.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
<S:Header>
<To xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">http://iol.test.ohie.org:5001/xdsrepository</To>
<Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</Action>
<ReplyTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo>
<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:9553ce76-ff03-4da6-ad82-b417224186bb</MessageID>
</S:Header>
<S:Body>
<ns4:ProvideAndRegisterDocumentSetRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns4="urn:ihe:iti:xds-b:2007" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
<ns3:SubmitObjectsRequest>
<RegistryObjectList>
<ExtrinsicObject id="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" mimeType="text/plain" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
<Slot name="creationTime">
<ValueList>
<Value>20130104</Value>
</ValueList>
</Slot>
<Slot name="languageCode">
<ValueList>
<Value>en-us</Value>
</ValueList>
</Slot>
<Slot name="serviceStartTime">
<ValueList>
<Value>201211150855</Value>
</ValueList>
</Slot>
<Slot name="serviceStopTime">
<ValueList>
<Value>201211150855</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientId">
<ValueList>
<Value>RJ-439^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientInfo">
<ValueList>
<Value>PID-3|RJ-439^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
<Value>PID-5|Patient^Mary^^^</Value>
<Value>PID-8|F</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Physical"/>
</Name>
<Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" id="urn:uuid:700f61d9-2a3f-45ef-aae7-e0134fab2d54" nodeRepresentation="">
<Slot name="authorPerson">
<ValueList>
<Value>556677^^^^^^^^&amp;2.25.309768652999692686176651983274504471835.646.3.4&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="authorInstitution">
<ValueList>
<Value>Some Hospital^^^^^&amp;1.2.3.4.5.6.7.8.9.1789&amp;ISO^^^^45</Value>
</ValueList>
</Slot>
</Classification>
<Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" id="urn:uuid:db1c5333-ed3c-41cc-b8ed-420ea2e15b6c" nodeRepresentation="51851-4">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString charset="UTF-8" value="Workflow" xml:lang="en-us"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" id="urn:uuid:1cd1c537-f495-4dfd-b1dc-2a82d3c61d36" nodeRepresentation="N">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.5.25</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Normal"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" id="urn:uuid:c03fa039-d7bc-406f-8007-b74038d69cb5" nodeRepresentation="urn:ihe:pcc:ic:2009">
<Slot name="codingScheme">
<ValueList>
<Value>1.3.6.1.4.1.19376.1.2.3</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString charset="UTF-8" value="urn:ihe:rad:TEXT" xml:lang="en-us"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" id="urn:uuid:4f826f96-76fd-4663-a212-7b4a05e4f3e5" nodeRepresentation="281NR1301N">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.5.11</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Hospitals; General Acute Care Hospital; Rural"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" id="urn:uuid:2c3b041a-2696-4333-8a68-e09e6ce70090" nodeRepresentation="General Medicine">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon practiceSettingCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="General Medicine"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" id="urn:uuid:e51e9cce-978c-40bf-a864-0f1da10425aa" nodeRepresentation="11369-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="History And Physical Note"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:08fad65a-6eb0-4da3-99eb-1be837010150" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" registryObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" value="117^^^&amp;1.3.6.1.4.1.33349.3.1.3.201203.2.0.0&amp;ISO">
<Name>
<LocalizedString value="XDSDocumentEntry.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:ce486ffe-27a9-4eec-89d6-147fadb74870" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" registryObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" value="#{{docUniqueId}}">
<Name>
<LocalizedString value="XDSDocumentEntry.uniqueId"/>
</Name>
</ExternalIdentifier>
</ExtrinsicObject>
<RegistryPackage id="urn:uuid:c0149d06-7f32-4453-b28e-c4d5244c35ee">
<Slot name="submissionTime">
<ValueList>
<Value>20130104</Value>
</ValueList>
</Slot>
<Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="urn:uuid:c0149d06-7f32-4453-b28e-c4d5244c35ee" id="urn:uuid:63504f8a-9229-4307-bef5-14e8ee3e134c" nodeRepresentation="11369-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="History and Physical"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:d8682df6-8518-4653-a5d3-8c4827f8970d" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" registryObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" value="RJ-439^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO">
<Name>
<LocalizedString value="XDSSubmissionSet.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:c82cc901-fa60-4c48-ac86-5c6b475a5d04" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" registryObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" value="2009.9.1.2456">
<Name>
<LocalizedString value="XDSSubmissionSet.uniqueId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:3ce33c19-e23d-46b6-b506-ca44dac12f8b" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" registryObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961" value="1.3.6.1.4.1.21367.2010.1.2">
<Name>
<LocalizedString value="XDSSubmissionSet.sourceId"/>
</Name>
</ExternalIdentifier>
</RegistryPackage>
<Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="urn:uuid:c0149d06-7f32-4453-b28e-c4d5244c35ee" id="urn:uuid:f1c82f24-d91d-4945-8a63-81d06f3ee995"/>
<Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="urn:uuid:c9abae3c-688f-4505-a136-bd99ca5019fb" sourceObject="urn:uuid:c0149d06-7f32-4453-b28e-c4d5244c35ee" targetObject="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961">
<Slot name="SubmissionSetStatus">
<ValueList>
<Value>Original</Value>
</ValueList>
</Slot>
</Association>
</RegistryObjectList>
</ns3:SubmitObjectsRequest>
<ns4:Document id="urn:uuid:05b0de7f-cb5e-41dc-9a91-62202f5f0961">
<xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:cd511abc-559c-4e32-bb0e-94488a849941"/>
</ns4:Document>
</ns4:ProvideAndRegisterDocumentSetRequest>
</S:Body>
</S:Envelope>
